# Задание 15.2

## Как считывать данные

### Читаем одно значение

Чтобы считать строку, просто пишем:

```python
string = input() # string = "42"
```

Чтобы считать целое число, Нужно обернуть считанную строку в функцию `int()`:

```python
number = int(input()) # number = 42
```

### Читаем несколько значений

Читаем несколько значений, введённых в одной строке через пробел (разрезаем полученную строку с помощью `split()`):

```python
s1, s2, s3 = input().split() # s1 = "11" s2 = "12", s3 = "13"
```

Конвертируем введённые значения в числа:

```python
strings = input().split() # strings = ["11", "12", "13"]
n1, n2, n3 = list(map(int, strings))
```

В коде выше мы:

1. Считали строку с помощью `input()`
2. Разрезали её на части (`.split()`)
3. К полученному массиву применили фунцию `map()`, применив функцию `int()` к каждому элементу массива
4. Превратили полученные данные в массив (`list()`)

А теперь то же самое в одну строчку:

```python
n1, n2, n3 = list(map(int, input().split()))
```

## Решаем задачу

### Если количество чисел известно

#### Задача

Напишите программу, которая в последовательности натуральных чисел определяет *%условие%*. **Программа получает на вход количество чисел в последовательности**, а затем сами числа. В последовательности всегда имеется число, *%условие%*.

Количество чисел не превышает *%X%*. Введённые числа не превышают *%Y%*.

Программа должна вывести одно число — *%условие%*.

#### Решение

```python
N = int(input()) # получаем количество чисел

%дополнительные переменные%

for i in range(N): # перебираем i в диапазоне от 0 до N - 1
  number = int(input()) # читаем число
  if %условие%: # проверяем число на соответствие условиям
    %действие% # обновляем переменную результата

print(%ответ%)
```

### Если количество чисел неизвестно

#### Задача

Напишите программу, которая в последовательности натуральных чисел определяет, есть ли в последовательности хотя бы одно число, *%условие%*. **Программа получает на вход последовательность натуральных чисел, заканчивающуюся нулём.**

Количество чисел не превышает *%X%*. Введённые числа не превышают *%Y%*.

Программа должна вывести одно число — *%условие%*.

#### Решение

```python
%дополнительные переменные%

while True: # начинаем бесконечный цикл
  number = int(input()) # считываем число
  if number == 0: # проверяем, равно ли оно нулю
    break # если да, то прерываем цикл
  if %условие%: # проверяем число на соответствие условиям
    %действие% # обновляем переменную результата

print(%ответ%)
```

### Если нужно вывести численный ответ

#### Задача

...

Программа должна вывести одно число — *%условие%*.

#### Решение

```python
...

answer = %начальное значение%

%цикл с решением%

print(answer)
```

### Если нужно вывести YES или NO

Если в условии задачи сказано, что нужно вывести YES, если в последовательности есть **хотя бы одно число** соответствующее условиям, то начальное значение `answer` устанавливаем в `False` - мы надеемся, что таких чисел нет.

Если в условии задачи сказано, что нужно вывести YES, если в последовательности **все числа** соответствуют условиям, то начальное значение `answer` устанавливаем в `True` - мы надеемся, что все числа подходят.

#### Задача

...

Программа должна вывести «YES», если в последовательности есть хотя бы одно число, *%условие%*, и «NO» в противном случае.

#### Решение

```python
...

answer = False # или True, в зависимости от задачи

%цикл с решением%

if (answer):
  print("YES")
else:
  print("NO")
```
